Autodesk.Revit.DB.Structure.BendingDetailFor3DShapesOptions
Describes how the Bending Detail will be represented for 3D shapes.
Since:
2024
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailFor3DShapesOptions.PlanView
The bending detail will represent the bar as in a plan view where the view plane is parallel with bar plane.

Autodesk.Revit.DB.Structure.BendingDetailFor3DShapesOptions.IsometricView
The bending detail will represent the bar as in an isometric view.